const funNotice = [
  {
    id: 1,
    title: 0,
    category: "← 공지사항",
    titleName: "📢 컴프야펀 소프트런칭 안내",
    version: "v0.1.0",
    updateDate: "2025-12-19",
    summary: [
      "컴프야 펀 소프트 런칭",
      "공식카페 팁 게시글을 한눈에 모아보기"
    ],
    contents: [
      "안녕하세요 컴프야 공식카페에서 활동하고 있는 dprian 입니다.",
      "생각보다 공식카페에서 공략글이 드래곤볼이다 보니, 정보성 공략글을 한 사이트에서 볼 수 있었으면 좋겠다는 취지로 사이트를 제작하게 되었습니다.",
      "최초로 사이트 운영 목적은 뉴비&복귀 유저들이 진입하기 쉽게 정보성 글을 모아 한눈에 볼 수 있게끔 정리할 예정입니다.",
      "더 나아가, 어느정도 안정적으로 운영이 되면서, 매번 돌아오는 이벤트 등에 대해서 게시할 목적입니다.",
      "1인 취미 개발 사이트다 보니 업데이트가 조금 느릴 수 있는데, 꾸준히 업로드 하도록 하겠습니다.",
      "PC로 볼 수 있는 컨텐츠 먼저 작업 진행하도록 하겠습니다."
    ]
  }
]

export default funNotice;
