const funNotice = [
  {
    id: 1,
    title: 0,
    category: "← 공지사항",
    titleName: "📢 컴프야펀 소프트런칭 안내",
    version: "v0.1.0",
    updateDate: "2025-12-19",
    summary: [
      "컴프야 펀 소프트 런칭",
      "현재 기능 : 공식카페 이벤트 및 쿠폰 정리",
      "추후 업데이트 예정 기능 : 공식카페 공략글 링크 모아보기 및 링크 페이지 작성"
    ],
    contents: [
      "안녕하세요 컴프야 공식카페에서 활동하고 있는 dprian 입니다.",
      "생각보다 공식카페에서 공략글이 드래곤볼이다 보니, 정보성 공략글을 한 사이트에서 볼 수 있었으면 좋겠다는 취지로 사이트를 제작하게 되었습니다.",
      "최초로 사이트 운영 목적은 뉴비&복귀 유저들이 진입하기 쉽게 정보성 글을 모아 한눈에 볼 수 있게끔 정리할 예정입니다.",
      "더 나아가, 어느정도 안정적으로 운영이 되면서, 매번 돌아오는 이벤트 등에 대해서 게시할 목적입니다.",
      "1인 취미 개발 사이트다 보니 업데이트가 조금 느릴 수 있는데, 꾸준히 업로드 하도록 하겠습니다.",
      "PC로 볼 수 있는 컨텐츠 먼저 작업 진행하도록 하겠습니다."
    ]
  },
  {
    id: 2,
    title: 0,
    category: "← 공지사항",
    titleName: "📢 고스변 시뮬레이터 업데이트",
    version: "v0.1.1",
    updateDate: "2025-12-25",
    summary: [
      "사이트에 고스변 시뮬레이터 sample을 업데이트",
      "공식 컴프야 인게임 확률표를 참고",
      "https://hive-fn.qpyou.cn/markup/img/2016/tf/cpb2015_1_3.html?v=4070",
      "추후 업데이트 예정 기능 : 타자편 시뮬레이터 추가, 플래티넘 시뮬레이터 추가, 확률 게시"
    ],
    contents: [
      "안녕하세요 컴프야 공식카페에서 활동하고 있는 dprian 입니다.",
      "공식 컴프야 인게임 확률표를 참고하여 살짝만 설명하자면, 3레전이 뜰 확률은 0.2782%, 2레전이 뜰 확률은 2.1701% 입니다",
      "매우 낮은 확률 구간에 대해서도 단순 계산이 아닌 대량 반복 시뮬레이션을 통해 실제 결과 분포를 검증한 후 적용하였습니다.",
      "- 매 시도마다 예측 불가능한 난수를 새로 생성합니다.",
      "- 생성된 난수는 0~100 범위의 연속값으로 변환됩니다.",
      "- 각 능력은 고지된 확률만큼의 구간(비율)을 차지하며, 난수가 속한 구간에 따라 결과가 결정됩니다.",
      "개별 시도에서는 운에 따른 편차가 존재하더라도 전체 분포 기준으로는 고지된 확률과 거의 동일한 결과가 나오도록 구성되어 있습니다.",
      "추후에 업데이트 하는 내용들은 컴프야에서 이제껏 실험해 왔던 것을 시뮬레이터 형식으로 테스트 해보기에 적합하실 겁니다.",
    ]
  },
  {
    id: 3,
    title: 0,
    category: "← 공지사항",
    titleName: "📢 팁 모아보기 업데이트",
    version: "v0.1.2",
    updateDate: "2025-12-29",
    summary: [
      "공식카페에서 팁 게시판이 제대로 운영되지 않아 검색에 불편함을 느끼시는 분들을 위한!",
      "팁 모아보기 페이지를 런칭 (2025년도 팁 게시판 글 918개 => 분석/공략 게시글 179개) ",
      "2025년도 글 + 전체 팁 게시판 글 정리 예정",
      "팁 게시판 태그별로 검색 기능 추가 및 필터 기능 추가 예정",
      "특정 네임드 유저 게시글 모아보기 기능 추가 및 중복 추천글 가공 예정"
    ],
    contents: [
      "안녕하세요 컴프야 공식카페에서 활동하고 있는 dprian 입니다.",
      "현재 공식카페에서 게임관련 팁 게시판이 제대로 운영되고 있지 않아, 팁을 효율적으로 검색하기 어려운 상황입니다.",
      "그래서 팁 게시판에 기재된 다양한 분들이 작성해주신 공략글을 수기로 검증하여, 팁 모아보기 페이지를 출시했습니다.",
      "2025년도 팁 게시판 918개 중 어그로나 승부예측 등 단기간에 소모되는 컨텐츠를 제외한 분석이나 공략글 위주로 모아보기 진행했습니다.",
      "지금 당장은 데이터를 긁어오는 정도에 그친 수준이지만 차츰차츰 업데이트 하여, 좀 더 세부 내용을 정리하도록 하겠습니다.",
      "아마 데이터 업데이트 주기는 매달 1일 정도로 예상하고 있습니다.",
      "검색기능이나 필터기능, 태그 기능은 추후에 업데이트 하도록 하겠습니다.",
    ]
  },
  {
    id: 4,
    title: 0,
    category: "← 공지사항",
    titleName: "📃 2026 패치노트 - 투수 스킬 조합 백과사전 추가",
    version: "v0.1.4",
    updateDate: "2026-01-02",
    summary: [
      "수정부분을 보완하기 위해서 패치노트를 추가",
      "굵직한 업데이트 내용을 제외하고는 패치노트에 기재할 예정",
      "버그 제보나 컨텐츠 추천 받을 시 패치노트를 통해 업데이트에 반영 예정"
    ],
    contents: [
      "안녕하세요 컴프야 공식카페에서 활동하고 있는 dprian 입니다.",
      "새해를 맞이하여 다양한 업데이트 준비를 하고 있습니다",
      "사이트 유저 이용 풀 및 사용하시는 기기에 맞게 좀 더 최적화 하여 작업하기 위해, google analytics 를 적용하였습니다",
      "사이트 이용하시는데 있어서 개인정보처리 방침 또한 법적으로 적법하게 작성하였습니다.",
      "2026-01-01 패치노트",
      "- 모바일에서 디자인이 깨지는 부분 수정",
      "- 이벤트/쿠폰 페이지에서 종료된 내용과 현재 진행 중인 이벤트를 구분하기 어려운 문제 수정",
      "- 컴프야 공식 카페에서 진행하는 이벤트를 확인이 불가능하여, 데이터 추가",
      "2026-01-02 패치노트 - 투수 스킬 조합편 추가 - feat. 환이박사",
      "- 환이박사님 작성글 참조 점수로 치환",
      "링크 : https://cafe.naver.com/com2usbaseball2015/1807733",
      "- 가능한 조합을 레전드 위주로 작업 진행",
      "- 플레티넘 스킬 조합 및 타자 스킬 조합도 추후 업데이트 예정",
      "- 스킬에 다른 견해나 수정사항이 있는 경우에는 공식카페 링크에 댓글 참조 부탁드립니다.",
      "-> 문의 댓글 : https://cafe.naver.com/com2usbaseball2015/1934310",
      "2026-01-02 08:58 (수정) : 배테랑 => 베테랑 글자 수정"
    ]
  },
]

export default funNotice;
